package lesson6;

public class Task2 {
//    2. Продумайте структуру класса Кот. какие поля и методы будут актуальны для приложения.
//    а) информационной системой ветеринарной клиники
//    б) архивом выставки котов
//    в) информационной системой Театра кошек Ю.Д. Куклачева
//    Можно записать в текстовом виде, не обязательно реализовать в java
//    3. Реализуйте 1 из вариантов класса Cat из предыдущего задания, можно использовать не все
//    придуманные поля и методы. Создайте несколько экземпляров этого класса, выведите их в консоль.
//    Добейтесь того, чтобы при выводе в консоль объекта типа Cat, выводилась его кличка, цвет и возраст
//    (или другие паораметры на ваше усмотрение).

}
